code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаЦенныхБумагИзНРД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаЦенныхБумагИзНРД</Name>
			<Comment>Для загрузки в базу Депозитария</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогДанныхИсточник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанныхПриемник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Купоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>code_nsd</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>action_id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>coupon_number</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>interest_rate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>size</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>payment_date_calc</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>payment_date_plan</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>record_date_calc</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>record_date_plan</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>payment_date_fact</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаНоминалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаЦенныхБумагИзНРД/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыборПериода(Команда)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.УстановитьПериод(Объект.ДатаНач, ?(Объект.ДатаКон=Дата("00010101"), Объект.ДатаКон, КонецДня(Объект.ДатаКон)));
		НастройкаПериода.РедактироватьКакПериод = Истина;
		НастройкаПериода.ВариантНастройки 		= ВариантНастройкиПериода.Период;
		
		Если НастройкаПериода.Редактировать() Тогда
			Объект.ДатаНач = НастройкаПериода.ПолучитьДатуНачала();
			Объект.ДатаКон = НастройкаПериода.ПолучитьДатуОкончания();
		КонецЕсли;
	#Иначе
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();
		Период = Новый СтандартныйПериод(Объект.ДатаНач,  ?(Объект.ДатаКон=Дата("00010101"), Объект.ДатаКон, КонецДня(Объект.ДатаКон)));
		Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Диалог.Период = Период;
		Если Диалог.Редактировать() Тогда 
			Объект.ДатаНач = Диалог.Период.ДатаНачала;
			Объект.ДатаКон = Диалог.Период.ДатаОкончания;
		КонецЕсли; 
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Если ЗначениеЗаполнено(Объект.ДатаНач) И ЗначениеЗаполнено(Объект.ДатаКон) И Объект.ДатаНач <= Объект.ДатаКон Тогда
		Если ЗагрузитьНаСервере() Тогда
			Предупреждение("Загрузка успешно завершена.");
		Иначе
			Предупреждение("Во время загрузки происходили ошибки. См. журнал регистрации.");
		КонецЕсли;
	Иначе
		Предупреждение("Укажите корректный период загрузки.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗагрузитьНаСервере()
	мОбъект = РеквизитФормыВЗначение("Объект");
	РезультатЗагрузки = мОбъект.ВыполнитьЗагрузкуЗаПериод(Объект.ДатаНач, Объект.ДатаКон, Объект.КаталогДанныхИсточник, Объект.КаталогДанныхПриемник);
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
	Возврат РезультатЗагрузки;
КонецФункции
